-- ----------------------------
-- 显示所有数据库
-- ----------------------------
SHOW DATABASES;

-- ----------------------------
-- 进入某个数据库
-- ----------------------------
USE 数据库名;

-- ----------------------------
-- 创建一个数据库
-- ----------------------------
CREATE DATABASE 数据库名;

-- ----------------------------
-- 创建指定字符集的数据库
-- ----------------------------
CREATE DATABASE 数据库名 DEFAULT CHARACTER SET  utf8 COLLATE utf8_general_ci;

-- ----------------------------
-- 显示数据库的创建信息
-- ----------------------------
SHOW CREATE DATABASE 数据库名;

-- ----------------------------
-- 修改数据库的编码
-- ----------------------------
ALERT DATABASE 数据库名 CHARACTER SET utf8 COLLATE utf8_general_ci;

-- ----------------------------
-- 删除一个数据库
-- ----------------------------
drop database 数据库名;

-- ----------------------------
-- 修改表名
-- ----------------------------
ALTER TABLE 旧表名 RENAME TO 新表名;

-- ----------------------------
-- 修改字段的数据类型
-- ----------------------------
ALTER TABLE 表名 MODIFY (字段名 字段类型 默认值 是否为空);

-- ----------------------------
-- 修改字段名
-- ----------------------------
ALTER TABLE 表名 RENAME COLUMN 列名 TO 新列名

-- ----------------------------
-- 添加字段
-- ----------------------------
ALTER ADD命令格式：ALTER TABLE 表名 ADD 字段名 类型 其他;

-- ----------------------------
-- 删除字段
-- ----------------------------
ALTER TABLE 表名 DROP 字段名

-- ----------------------------
-- 修改表的存储引擎
-- ----------------------------
ALTER TABLE 表名 ENGINE = 存储引擎类型;

-- ----------------------------
-- 删除表的外键约束
-- ----------------------------
ALTER TABLE VIP DROP FOREIGN KEY 约束ID;

-- ----------------------------
-- 删除一张表
-- ----------------------------
DROP TABLE 表名;